tutorials/ocmfMassTransferDns/NaCl_nG785_C5_P60_J60_Lx5_Ly1_Lz25/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;
method scotch;
// method          simple;

simpleCoeffs
{
    n               (3 1 1);
    delta           0.001;
}

preservePatches ( yMinus yPlus zMinus zPlus );

distributed     no;

roots           
(
);

// ************************************************************************* //
