tutorials/ocmfMassTransferDns/NaCl_nG785_C5_P60_J60_Lx5_Ly1_Lz25/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./constant/simulationConditions"
defaultFieldValues
(
    volScalarFieldValue CA $CA0
);

regions
(
    // Set cell values
    boxToCell
    {
        box (0.0282 -0.0016 -0.01444) (0.03645 0.0017 -0.01314);
        fieldValues
        (
            volScalarFieldValue CA $CAin
        );
    }
    boxToCell
    {
        box (0.03012733 -0.0016 -0.01314) (0.03837733 0.0017 -0.01184);
        fieldValues
        (
            volScalarFieldValue CA $CAin
        );
    }
// box step #2
boxToCell
{
    box (0.03205466 -0.00160000 -0.01184000) (0.04030466 0.00170000 -0.01054000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

// box step #3
boxToCell
{
    box (0.03398199 -0.00160000 -0.01054000) (0.04223199 0.00170000 -0.00924000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

// box step #4
boxToCell
{
    box (0.03590932 -0.00160000 -0.00924000) (0.04415932 0.00170000 -0.00794000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

// box step #5
boxToCell
{
    box (0.03783665 -0.00160000 -0.00794000) (0.04608665 0.00170000 -0.00664000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

// box step #6
boxToCell
{
    box (0.03976398 -0.00160000 -0.00664000) (0.04801398 0.00170000 -0.00534000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

// box step #7
boxToCell
{
    box (0.04169130 -0.00160000 -0.00534000) (0.04994130 0.00170000 -0.00404000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

// box step #8
boxToCell
{
    box (0.04361863 -0.0160000 -0.00404000) (0.05186863 0.00170000 -0.00274000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}
// box step #9
boxToCell
{
    box (0.04554596 -0.160000 -0.00274000) (0.095379596 0.0170000 0.0144000);
    fieldValues
    (
        volScalarFieldValue CA $CAin
    );
}

);

// ************************************************************************* //
